
/////////////////////////////////////////////////////////////////////////
// РЕГИСТРАЦИЯ ВНЕШНЕЙ ОБРАБОТКИ

#Область РегистрацияВнешнейОбработки

Функция СведенияОВнешнейОбработке() Экспорт 
	
	РегистрационныеДанные = Новый Структура;
    РегистрационныеДанные.Вставить("Наименование", "Выгрузка документов в 1с77");
    РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
    РегистрационныеДанные.Вставить("Вид", "ДополнительнаяОбработка");
    РегистрационныеДанные.Вставить("Версия", "1.8");
    РегистрационныеДанные.Вставить("Информация", "Выгрузка документов в 1с77"
    );
    
    ///////////// команды /////////////////////////
    тзКоманд = Новый ТаблицаЗначений;
    тзКоманд.Колонки.Добавить("Идентификатор",             Новый ОписаниеТипов("Строка"));
    тзКоманд.Колонки.Добавить("Представление",             Новый ОписаниеТипов("Строка"));
    тзКоманд.Колонки.Добавить("Модификатор",             Новый ОписаниеТипов("Строка"));
    тзКоманд.Колонки.Добавить("ПоказыватьОповещение",     Новый ОписаниеТипов("Булево"));
    тзКоманд.Колонки.Добавить("Использование",             Новый ОписаниеТипов("Строка"));
    
    строкаКоманды = тзКоманд.Добавить();
    строкаКоманды.Идентификатор         = "Выгрузить"; 
    строкаКоманды.Представление         = "Выгрузка документов в 1с77";
    строкаКоманды.ПоказыватьОповещение  = Истина;
    строкаКоманды.Использование         = "ОткрытиеФормы";
    
    РегистрационныеДанные.Вставить("Команды", тзКоманд);
    
    Возврат РегистрационныеДанные;
КонецФункции

#КонецОбласти
